<?php
/*
*气体方数计算
*不同的公式推到方式不一样
*/
class eleGasVules
{
   private $rongji;         //容积
   private $t01;            //装卸前温度
   private $t02;            //装卸后温度
   private $p01;            //装卸前压力
   private $p02;            //装卸后压力
   private $rc;             //常数
	
	public function __construct($rongji,$t01=10,$t02=10,$p01,$p02,$rc=8.314)
    {
		$this->rongji = $rongji;
		$this->t01 = $t01;
		$this->t02 = $t02;
		$this->p01 = $p01;
		$this->p02 = $p02;
		$this->rc = $rc;
    }
	
	//------------------------------------------------------------
	//东元计算
	public function dongyuanJS(){
		$rj=$this->rongji;
		$wd01=$this->t01+273;    //换算成摄氏度
		$wd02=$this->t02+273;    //换算成摄氏度
		$yl01=$this->p01*1000000;   //换算成Pa
		$yl02=$this->p02*1000000;//换算成Pa
		$cs=8.31;               //常数取两位
		
		//公式计算
		$tep1=$yl02/$wd02-$yl01/$wd01;
		$tep2=$cs*1000;
		$tep3=$tep1/$tep2;
		$tep4=$tep3*$rj*22.4;
		//公式计算
		$tep5=round($tep4,2);     //保留两位小数
		return $tep5;
	}
	//东元计算
	//------------------------------------------------------------
	
	//------------------------------------------------------------
	//济宁宝钢计算
	public function baogangJS(){
		//和东元相比，只是常数取值精度不一样
		$rj=$this->rongji;
		$wd01=$this->t01+273;    //换算成摄氏度
		$wd02=$this->t02+273;    //换算成摄氏度
		$yl01=$this->p01*1000000;   //换算成Pa
		$yl02=$this->p02*1000000;//换算成Pa
		$cs=8.314;               //常数取三位
		
		//公式计算
		$tep1=$yl02/$wd02-$yl01/$wd01;
		$tep2=$cs*1000;
		$tep3=$tep1/$tep2;
		$tep4=$tep3*$rj*22.4;
		//公式计算
		$tep5=round($tep4,2);     //保留两位小数
		return $tep5;
	}
	//济宁宝钢计算
	//------------------------------------------------------------
	
	//------------------------------------------------------------
	//压力差长管计算
	public function yalichaJS(){
		//此方法没有引入温度的概念
		$rj=$this->rongji;
		//$wd01=$this->t01+273;    //换算成摄氏度
		//$wd02=$this->t02+273;    //换算成摄氏度
		$yl01=$this->p01*10;       //换算成ba
		$yl02=$this->p02*10;       //换算成ba
		//$cs=8.314;               //常数取三位
		
		//公式计算
		$tep1=$yl01-$yl02;
		$tep2=$tep1*10*$rj;
		
		//公式计算
		$tep3=round($tep2,2);     //保留两位小数
		return $tep3;
	}
	//压力差长管计算
	//------------------------------------------------------------
	
}
?>